app/controllers/articles_controller.rb

  def index     #junta todos los articulos
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params) #este guarda la plantilla del new

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Prueba numero 1"], ["body", "Ese articulo es una prueba de scaffolding"], ["created_at", "2015-06-03 15:58:22.815732"], ["updated_at", "2015-06-03 15:58:22.815732"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Prueba 2"], ["updated_at", "2015-06-03 15:59:24.450438"], ["id", 2]]